s = input()
total = 0
for i in range(10):
    total += s.count(str(i))
print(total)

"""
На вход программе подается строка текста. Напишите программу, которая подсчитывает количество цифр 
в данной строке.
"""