n = int(input())
text = str(n)
max_num = max(text)
min_num = min(text)
print('Максимальная цифра равна', max_num)
print('Минимальная цифра равна', min_num)

#Дано натуральное число n,(n≥10). Напишите программу, которая определяет его максимальную и минимальную цифры.