number = int(input())
mas = []

for i in range(number):
    line = input()
    mas.append(line)

print(mas)

"""
На вход программе подается натуральное число n, а затем n строк. Напишите программу, которая создает из указанных строк список и выводит его.
"""