text = input()
for i in range(0, len(text)):
    print(ord(text[i]), end=' ')

"""
На вход программе подается строка текста. Напишите программу, которая переводит каждый ее символ в 
соответствующий ему код из таблицы символов Unicode.
"""