a = int(input())
if a == 2:
    print('28')
elif a == 1 or a == 3 or a == 5 or a == 7 or a == 8 or a == 10 or a == 12:
    print('31')
else:
    print('30')

"""Дан порядковый номер месяца (1,2,…, 12). 
Напишите программу, которая выводит на экран количество дней в этом месяце. 
Принять, что год является невисокосным."""