a = int(input())
b = int(input())
if a > b:
    print(b)
else:
    print(a)

#Напишите программу, которая определяет наименьшее из двух чисел.