age = int(input())
if age >= 18:
    print('Доступ разрешен')
else:
    print('Доступ запрещен')

#Напишите программу, которая определяет, разрешён ли пользователю доступ к интернет-ресурсу или нет.