num = int(input())
if num % 2 == 0:
    print('Четное')
else:
    print('Нечетное')

#Напишите программу, которая определяет, является число чётным или нечётным.