n = int(input())
for i in range(n):
    for i in range(3):
        print(n, end=' ')
    print()

"""
Дано натуральное число n (n≤ 9). Напишите программу, которая печатает таблицу размером n×3, 
состоящую из данного числа (числа отделены одним пробелом).
"""