n = int(input())
for i in range(1, n+1):
    for j in range(1, i+1):
        print(i, end='')
    print()

"""
Дано натуральное число n. Напишите программу, которая печатает численный треугольник в соответствии 
с примером:

1
22
333
4444
55555
...
"""