sm = int(input())
m = sm // 100
print(m)

#Напишите программу, которая находит полное число метров по заданному числу сантиметров.