a = input()
if '@' in a and '.' in a:
    print('YES')
else:
    print('NO')

"""
Будем считать email адрес корректным, если в нём есть символы собачки (@) и точки (.). 
Напишите программу, проверяющую корректность email адреса.
"""