a = input()
s = 'синий'
if s in a:
    print('YES')
else:
    print('NO')

"""
Напишите программу, которая считывает одну строку, после чего выводит «YES», 
если во введённой строке есть подстрока «синий», или «NO» в противном случае.
"""