a = input()
length = len(a)
print('Футбольная команда', a, 'имеет длину', length, 'символов')

"""
Напишите программу, которая считывает с клавиатуры название футбольной команды и выводит информацию 
о ней в следующем формате:

Футбольная команда <название футбольной команды> имеет длину <длина названия футбольной команды> символов
"""