a = input()
if 'суббота' in a or 'воскресенье' in a:
    print('YES')
else:
    print('NO')

"""
Напишите программу, которая считывает одну строку, после чего выводит «YES» (без кавычек), 
если во введённой строке есть подстрока «суббота» или «воскресенье», или «NO» (без кавычек) 
в противном случае.
"""