name = input()
family = input()
print('Hello', name, family + '!', 'You have just delved into Python')

"""
Напишите программу, которая считывает с клавиатуры две строки – имя и фамилию пользователя и выводит фразу:

Hello <введённое имя> <введённая фамилия>! You have just delved into Python
"""