a = int(input())
b = int(input())
print(a, '+', b, '=', a+b)
print(a, '-', b, '=', a-b)
print(a, '*', b, '=', a*b)

"""Напишите программу, в которой вычисляется сумма,
 разность и произведение двух целых чисел, введенных с клавиатуры."""