a = int(input())
v = a * a * a
s = 6 * (a * a)
print('Объём =', v)
print('Площадь полной поверхности =', s)

"""Напишите программу, вычисляющую объём куба и площадь его полной поверхности
 по введенному значению длины ребра."""