a = int(input())
b = int(input())
f = 3 * ((a + b) * (a + b) * (a + b)) + 275 * (b * b) - 127 * a - 41
print(f)

#Напишите программу вычисления значения функции по введённым целым значениям a и b.