m = int(input())
s = int(input())
k = int(input())
ms = int(input())
print(3*(m+s+k+ms))

"""Напишите программу, которая считает стоимость трёх компьютеров,
 состоящих из монитора, системного блока, клавиатуры и мыши."""