x = int(input())
print('Следующее за числом', x, 'число:', x+1)
print('Для числа', x, 'предыдущее число:', x-1)

"""Напишите программу, которая считывает целое число и выводит для него
 на экран следующее и предыдущее целые числа в следующем формате:

Следующее за числом <текущее число> число: <следующее число>
Для числа <текущее число> предыдущее число: <предыдущее число>"""