x = int(input())
print(x)
print(x+1)
print(x+2)

"""Напишите программу вывода на экран трех последовательно идущих чисел,
 каждое на отдельной строке. Первое число вводит пользователь, 
 остальные числа вы должны сами вычислять в программе."""