x = int(input())
print(x, end='---')
print(2*x, end='---')
print(3*x, end='---')
print(4*x, end='---')
print(5*x)

"""Напишите программу, которая считывает целое положительное число x
x и выводит на экран последовательность чисел x, x2, x3, x4 и 5x, разделённых тремя черточками."""