from math import floor, ceil

x = float(input())
s = floor(x) + ceil(x)
print(s)

#Напишите программу, которая принимает на вход действительное число x и вычисляет по нему значение