a, b, c, d = input(''), input(''), input(''), input('')
print (b, c, d, sep = a)

"""Напишите программу, которая считывает строку-разделитель и три строки,
 а затем выводит указанные строки через разделитель в следующем формате:

<вторая строка><строка-разделитель><третья строка><строка-разделитель><четвертая строка>"""