name = input('')
print('Привет,', name, end='!')

"""Напишите программу, которая приветствует пользователя в следующем формате:
Привет, <имя пользователя>!
где <имя пользователя> – строка, которую ваша программа принимает на вход
 через стандартный поток ввода (команда input())."""