print('I', end='***')
print('like', end='***')
print('Python')

#Напишите программу, которая выводит на экран следующий текст: I***like***Python