s = input()
n = (len(s) + 1) // 2
print(s[n:]+s[:n])

"""
На вход программе подается строка текста. Напишите программу, которая разрежет ее на две равные части, 
переставит их местами и выведет на экран.
"""