"""На вход программе подаётся строка текста – имя человека. Напишите программу, которая принимает эту строку текста через стандартный поток 
ввода (команда input()). Далее программа должна выводить на экран приветствие в следующем формате:
Привет, <имя человека>
где <имя человека> – строка текста, которую ваша программа приняла на вход."""

name = input('')
print('Привет,', name)