"""Напишите программу, которая принимает через стандартный поток ввода (команда input()) три строки, 
а затем выводит их в той же последовательности, каждую на отдельной строке."""

a = input('')
b = input('')
c = input('')
print(a)
print(b)
print(c)