n = int(input())
n = list(range(1, n + 1))
print(n)

"""
На вход программе подается одно число n. Напишите программу, которая выводит список [1, 2, 3, ..., n].
"""