x = int(input())
if -3 < x < 7:
    print('Не принадлежит')
else:
    print('Принадлежит')

"""Напишите программу, которая принимает целое число x и определяет, 
принадлежит ли данное число указанным промежуткам"""