s = input()
print(s.replace('1', 'one'))

"""
На вход программе подается строка текста. Напишите программу, которая заменяет все вхождения цифры 
1 на слово «one».
"""