a = int(input())
b = int(input())
c = int(input())
d = int(input())
sum = a**b + c**d
print(sum)

"""Как известно, целые числа в языке Python не имеют ограничений, 
которые встречаются в других языках программирования. 
Напишите программу, которая считывает четыре целых положительных числа 
a,b,c и d и выводит на экран значение выражения"""