n = int(input())
sum = n + n * 11 + n * 111
print(sum)

"""Напишите программу, которая считывает целое положительное число n,
n∈[1;9] и выводит значение числа n + nn + nnn."""