print('*****************')
print('*               *')
print('*               *')
print('*****************')

#Напишите программу, которая выводит прямоугольник, по периметру состоящий из звездочек (*).