a = input()
b = int(input())
for i in range(b):
    print(a)

"""
Дано предложение и количество раз, сколько его надо повторить. 
Напишите программу, которая повторяет данное предложение нужное количество раз.
"""