n = int(input())
for i in range(n):
    print('*******************')

"""
На вход программе подается натуральное число n.
Напишите программу, которая печатает звездный прямоугольник размерами n×19.
"""