for i in range(6):
    print('AAA')
for i in range(5):
    print('BBBB')
print('E')
for i in range(9):
    print('TTTTT')
print('G')

"""
Напишите программу, которая использует ровно три цикла for для печати следующей 
последовательности символов
"""