total = 1

for i in range(1, 11):
    n = int(input())
    if n != 0:
        total *= n
print(total)

"""
Напишите программу, которая считывает 10 чисел и выводит произведение отличных от нуля чисел.
"""