total = 1

n = int(input())
for i in range(1, n + 1):
    total *= i
print(total)

"""
На вход программе подается натуральное число n. Напишите программу, которая вычисляет n!.
"""