name, family, patronymic = input(), input(), input()
print(family[0] + name[0] + patronymic[0])

"""
На вход программе подаются три строки: имя, фамилия и отчество (именно в таком порядке). 
Напишите программу, которая выводит инициалы человека.
"""