s = input()
if s == s.title():
    print('YES')
else:
    print('NO')

"""
На вход программе подаётся строка, состоящая из имени и фамилии человека, разделённых одним пробелом. 
Напишите программу, которая проверяет, что имя и фамилия начинаются с заглавной буквы.
"""