a, b = float(input()), float(input())
s = (1 / 2) * a * b
print(s)

#Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь.