a, b, c, d, e = float(input()), float(input()), float(input()), float(input()), float(input())
s = abs(a) + abs(b) + abs(c) + abs(d) + abs(e)
print(s)

"""Даны пять чисел a1, a2, a3, a4, a5. Напишите программу, которая вычисляет сумму их модулей 
∣a1∣ + ∣a2∣ + ∣a3∣ + ∣a4∣ + ∣a5∣."""