a, b, c, d, e = float(input()), float(input()), float(input()), float(input()), float(input())
n = int(max(a, b, c, d, e))
m = int(min(a, b, c, d, e))
print('Наименьшее число =', m)
print('Наибольшее число =', n)

#Напишите программу, которая находит наименьшее и наибольшее из пяти чисел.