a, b, c = int(input()), int(input()), int(input())
n = max(a, b, c)
m = min(a, b, c)
s = (a + b + c) - (n + m)
print(n, s, m, sep='\n')

#Напишите программу, которая упорядочивает три числа от большего к меньшему.