n = float(input())
n = (n * 10) % 10
m = int(n)
print(m)

#Дано положительное действительное число. Выведите его первую цифру после десятичной точки.