n = float(input())
m = int(n)
print(n - m)

#Дано положительное действительное число. Выведите его дробную часть.