tF = float(input())
tC = 5 / 9 * (tF - 32)
print(tC)

"""У известного американского писателя Рэя Бредбери есть роман «451 градус по Фаренгейту». 
Напишите программу, которая определяет, какой температуре по шкале Цельсия соответствует 
указанное значение по шкале Фаренгейта."""