x = float(input())
if x != 0:
    r = 1 / x
    print(r)
else:
    print('Обратного числа не существует')

"""Напишите программу, которая считывает с клавиатуры одно число и выводит обратное ему. 
Если при этом введённое с клавиатуры число – ноль, 
то вывести «Обратного числа не существует» (без кавычек)."""